app/controllers/money_transfers_controller.rb

SELECT "money_transfers".* FROM "money_transfers" WHERE (sender_id = (3) OR receiver_id = (3) AND status = ('Completed'))
---
  def index
    @money_transfers = MoneyTransfer.all

SELECT  "money_transfers".* FROM "money_transfers" WHERE "money_transfers"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def update
    @money_transfer = MoneyTransfer.find(params[:id])

INSERT INTO "money_transfers" ("sender_id", "receiver_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender_id", 3], ["receiver_id", 2], ["amount", 10.0], ["created_at", "2017-11-17 05:08:45.073119"], ["updated_at", "2017-11-17 05:08:45.073119"]]
---
  def create
    @money_transfer = MoneyTransfer.new(money_transfer_params)

    respond_to do |format|
      if @money_transfer.save