app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$11$SxBccAMtZk5A7HJAn.ORwuoPfaXaUPTi1er36ll3D/T4cahiiKzgK"], ["updated_at", "2017-11-21 04:32:38.414268"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update(user_params)